<!DOCTYPE html>
<!--[if IE]><![endif]-->
<html>

  <head>
    <meta charset="utf-8">
      <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
      <title>Full Text Querying with SPARQL | DotNetRDF Documentation </title>
      <meta name="viewport" content="width=device-width">
      <meta name="title" content="Full Text Querying with SPARQL | DotNetRDF Documentation ">
    
      <link rel="shortcut icon" href="../favicon.ico">
      <link rel="stylesheet" href="../styles/docfx.vendor.css">
      <link rel="stylesheet" href="../styles/docfx.css">
      <link rel="stylesheet" href="../styles/main.css">
      <meta property="docfx:navrel" content="../toc.html">
      <meta property="docfx:tocrel" content="toc.html">
    
    
    
  </head>
  <body data-spy="scroll" data-target="#affix" data-offset="120">
    <div id="wrapper">
      <header>

        <nav id="autocollapse" class="navbar navbar-inverse ng-scope" role="navigation">
          <div class="container">
            <div class="navbar-header">
              <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#navbar">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
              </button>

              <a class="navbar-brand" href="../index.html">
                <img id="logo" class="svg" src="../images/rdf_flyer.svg" alt="">
              </a>
            </div>
            <div class="collapse navbar-collapse" id="navbar">
              <form class="navbar-form navbar-right" role="search" id="search">
                <div class="form-group">
                  <input type="text" class="form-control" id="search-query" placeholder="Search" autocomplete="off">
                </div>
              </form>
            </div>
          </div>
        </nav>

        <div class="subnav navbar navbar-default">
          <div class="container hide-when-search" id="breadcrumb">
            <ul class="breadcrumb">
              <li></li>
            </ul>
          </div>
        </div>
      </header>
      <div role="main" class="container body-content hide-when-search">

        <div class="sidenav hide-when-search">
          <a class="btn toc-toggle collapse" data-toggle="collapse" href="#sidetoggle" aria-expanded="false" aria-controls="sidetoggle">Show / Hide Table of Contents</a>
          <div class="sidetoggle collapse" id="sidetoggle">
            <div id="sidetoc"></div>
          </div>
        </div>
        <div class="article row grid-right">
          <div class="col-md-10">
            <article class="content wrap" id="_content" data-uid="">
<h1 id="full-text-querying-with-sparql">Full Text Querying with SPARQL</h1>

<p>Full Text SPARQL is a non-standard extension to our SPARQL engine provided in the separate <strong>dotNetRDF.Query.FullText.dll</strong> library. This library is included in the standard distribution from the 0.6.0 release onwards.</p>
<p>It uses <a href="http://lucenenet.apache.org">Lucene.Net</a> to build and query full text indexes and allows you to leverage this capability directly from SPARQL queries. This document will guide you through the process of creating and querying a full text index.</p>
<h1 id="general-usage">General Usage</h1>
<p>To use the library you'll need to add a reference to <strong>dotNetRDF.Query.FullText.dll</strong> (<code>dotNetRDF.Query.FullText</code> on NuGet) into your project (or install it via NuGet) and you should ensure that Lucene.Net is included in your project as well as this provides the actual indexing and query functionality.
Using NuGet is the preferred way to install since it will sort out dependencies and framework versions for you.</p>
<p>The majority of the classes provided by this library can be found in the <code>VDS.RDF.Query.FullText</code> namespace, the only other class you'll typically need is the <a class="xref" href="../api/VDS.RDF.Query.Optimisation.FullTextOptimiser.html"><code>FullTextOptimiser</code></a> which is located in the <a class="xref" href="../api/VDS.RDF.Query.Optimisation.html"><code>VDS.RDF.Query.Optimisation</code></a> namespace.</p>
<h2 id="creating-an-index">Creating an Index</h2>
<p>Before you can perform full text queries you must first build an index from your RDF data. To do this you will use an instance of the <a class="xref" href="../api/VDS.RDF.Query.FullText.Indexing.IFullTextIndexer.html"><code>IFullTextIndexer</code></a> interface, an indexer provides the means to index Triples, Graphs and Datasets and builds an index which relates the full text of literal objects to one of the nodes of each Triple.</p>
<p>Currently the following implementations are available:</p>
<table>
<thead>
<tr>
<th>Indexer</th>
<th>Description</th>
</tr>
</thead>
<tbody>
<tr>
<td><a class="xref" href="../api/VDS.RDF.Query.FullText.Indexing.Lucene.LuceneSubjectsIndexer.html">LuceneSubjectsIndexer</a></td>
<td>Relates the Subject of the Triple to the full text of the Literal Object</td>
</tr>
<tr>
<td><a class="xref" href="../api/VDS.RDF.Query.FullText.Indexing.Lucene.LucenePredicatesIndexer.html">LucenePredicatesIndexer</a></td>
<td>Relates the Predicate of the Triple to the full text of the Literal Object</td>
</tr>
<tr>
<td><a class="xref" href="../api/VDS.RDF.Query.FullText.Indexing.Lucene.LuceneObjectsIndexer.html">LuceneObjectsIndexer</a></td>
<td>Relates the Object of the Triple to its own full text</td>
</tr>
</tbody>
</table>
<p>So let's look at an example of building an index:</p>
<pre><code class="lang-csharp">
using System;
using Lucene.Net.Analysis.Standard;
using Lucene.Net.Store;
using VDS.RDF;
using VDS.RDF.Query.FullText;
using VDS.RDF.Query.FullText.Indexing;
using VDS.RDF.Query.FullText.Indexing.Lucene;
using VDS.RDF.Query.FullText.Schema;

public class FullTextIndexingExample
{
	public static void Main(String[] args)
	{
		IFullTextIndexer indexer = null;
		try
		{
			//First get a Graph we want to Index
			Graph g = new Graph();
			g.LoadFromFile(&quot;example.ttl&quot;);

			//Then create an indexer and index the data
			indexer = new LuceneSubjectsIndexer(FSDirectory.Open(&quot;example&quot;), new StandardAnalyzer(), new DefaultIndexSchema());
			indexer.Index(g);
		}
		catch (Exception ex)
		{
			//Handle any errors that occurred during Indexing
		}
		finally
		{
			//Always dispose of your index when it's built to ensure that indexed data is persisted to the index
			if (indexer != null) indexer.Dispose();
		}
	}
}
</code></pre>
<p>Note that when we created the indexer we passed in a Lucene.Net <code>Directory</code> and an <code>Analyzer</code> - you can use whatever implementations of these you like with our indexers. The <a class="xref" href="../api/VDS.RDF.Query.FullText.Schema.DefaultIndexSchema.html"><code>DefaultIndexSchema</code></a> is a schema used to control how the indexed data is stored onto fields on the documents in the index, for most use cases you will only ever need to use this default implementation but you can implement your own if you are an advanced user.</p>
<h2 id="querying-an-index">Querying an Index</h2>
<p>To query an index you use a <a class="xref" href="../api/VDS.RDF.Query.FullText.Search.IFullTextSearchProvider.html"><code>IFullTextSearchProvider</code></a> instance, currently there is a single implementation <a class="xref" href="../api/VDS.RDF.Query.FullText.Search.Lucene.LuceneSearchProvider.html"><code>LuceneSearchProvider</code></a>. The following example demonstrates its usage:</p>
<pre><code class="lang-csharp">
using System;
using Lucene.Net.Analysis.Standard;
using Lucene.Net.Store;
using VDS.RDF;
using VDS.RDF.Query.FullText;
using VDS.RDF.Query.FullText.Search;
using VDS.RDF.Query.FullText.Search.Lucene;
using VDS.RDF.Query.FullText.Schema;
using VDS.RDF.Writing.Formatting;

public class FullTextSearchExample
{
	public static void Main(String[] args)
	{
		//This example assumes we've already created our index in a folder called example

		IFullTextSearchProvider provider = null;
		try
		{
			//Get a Lucene Search Provider
			provider = new LuceneSearchProvider(Lucene.Util.Version.LUCENE_30, FSDirectory.Open(&quot;example&quot;), new StandardAnalyzer(), new DefaultIndexSchema());

			//Use it to make a search and print the results
			NTriplesFormatter formatter = new NTriplesFormatter();
			foreach (IFullTextSearchResult result in provider.Match(&quot;text&quot;))
			{
				Console.WriteLine(&quot;Node: &quot; + result.Node.ToString(formatter) + &quot; - Score: &quot; + results.Score.ToString());
			}
		}
		catch (Exception ex)
		{
			//Handle any exceptions that occur during querying
		}
		finally
		{
			//Always dispose of a search provider when done as not doing so may cause problems with other code accesing your index
			if (provider != null) provider.Dispose();
		}
	}
}
</code></pre>
<p>As with our previous example the <code>LuceneSearchProvider</code> takes a Lucene.Net <code>Directory</code> and <code>Analyzer</code> plus a <a class="xref" href="../api/VDS.RDF.Query.FullText.Schema.IFullTextIndexSchema.html"><code>IFullTextIndexSchema</code></a>.</p>
<p>Note: This constructor allows you to omit either/both of the Analyzer or Schema, in this case this uses the default Lucene.Net <code>StandardAnalyzer</code> and/or the <code>DefaultIndexSchema</code></p>
<h1 id="full-text-querying-with-sparql-1">Full Text Querying with SPARQL</h1>
<p>So now that you've seen how to build and query an index programatically lets look at how you go about making a full text query via SPARQL. To do this you will need to create an instance of the <code>FullTextOptimiser</code> and attach it to your SPARQL Queries as an Algebra Optimiser.</p>
<p>The following example shows how to do this:</p>
<pre><code class="lang-csharp">
using System;
using Lucene.Net.Analysis.Standard;
using Lucene.Net.Store;
using VDS.RDF;
using VDS.RDF.Parsing;
using VDS.RDF.Query;
using VDS.RDF.Query.FullText;
using VDS.RDF.Query.FullText.Search;
using VDS.RDF.Query.FullText.Search.Lucene;
using VDS.RDF.Query.Optimisation;
using VDS.RDF.Writing.Formatting;

public class FullTextSparqlExample
{
	public static void Main(String[] args)
	{
		//This example assumes we've already created our index in a folder called example

		IFullTextSearchProvider provider = null;
		try
		{
			//Create our dataset
			InMemoryDataset dataset = new InMemoryDataset();
			//Assume we load it with data from somewhere...

			//Create and parse our query
			SparqlParameterizedString queryString = new SparqlParameterizedString();
			queryString.Namespaces.Add(&quot;pf&quot;, new Uri(FullTextHelper.FullTextMatchNamespace));
			queryString.CommandText = &quot;SELECT * WHERE { ?match pf:textMatch 'text' }&quot;;

			SparqlQueryParser parser = new SparqlQueryParser();
			SparqlQuery query = parser.ParseFromString(queryString);

			//Get a Lucene Search Provider
			//For simplicity I've used the short constructor which assume StandardAnalyzer and DefaultIndexSchema
			provider = new LuceneSearchProvider(Lucene.Util.Version.LUCENE_29, FSDirectory.Open(&quot;example&quot;));

			//Create the Full Text Optimiser and attach it to the query
			FullTextOptimiser optimiser = new FullTextOptimiser(provider);
			query.AlgebraOptimisers = new IAlgebraOptimiser[] { optimiser };

			//Now we can go ahead and run our query
			SparqlResultSet results = query.Evaluate(dataset) as SparqlResultSet;
			if (results != null)
			{
				NTriplesFormatter formatter = new NTriplesFormatter();
				foreach (SparqlResult result in results)
				{
					Console.WriteLine(result.ToString(formatter));
				}
			}
		}
		catch (Exception ex)
		{
			//Handle any exceptions that occur during querying
		}
		finally
		{
			//Always dispose of a search provider when done as not doing so may cause problems with other code accesing your index
			if (provider != null) provider.Dispose();
		}
	}
}
</code></pre>
<p>Those of you who may be familiar with <a href="http://jena.apache.org/documentation/larq/index.html">LARQ</a> will notice that the query syntax for full text query is identical to that.</p>
<p>So you can do things like get scores for matches:</p>
<pre><code class="lang-sparql">
# Get matches with scores
PREFIX pf: &lt;http://jena.hpl.hp.com/ARQ/property#&gt;

SELECT * WHERE { (?match ?score) pf:textMatch &quot;text&quot; . }
</code></pre>
<p>Or apply a limit on the results:</p>
<pre><code class="lang-sparql">
# Get up to 10 matches
PREFIX pf: &lt;http://jena.hpl.hp.com/ARQ/property#&gt;

SELECT * WHERE { ?match pf:textMatch ( &quot;text&quot; 10) . }
</code></pre>
<p>Or apply a score threshold to the results:</p>
<pre><code class="lang-sparql">
# Apply a Score Threshold of 0.75
PREFIX pf: &lt;http://jena.hpl.hp.com/ARQ/property#&gt;

SELECT * WHERE { ?match pf:textMatch ( &quot;text&quot; 0.75) . }
</code></pre>
<div class="NOTE">
<h5>Note</h5>
<p>You can apply either a limit/threshold on their own, in this case a threshold must be a decimal/double while a limit must be an integer.
If you wish to apply both a threshold and a limit the threshold is assumed to always appear first.
This is in line with the LARQ syntax for full text query.</p>
</div>
<h2 id="use-with-sparql-endpoints">Use with SPARQL Endpoints</h2>
<p>You can use Full Text Querying with SPARQL Endpoints by configuring it via the <a href="configuration/index.html">Configuration API</a>, see <a href="configuration/full_text_query.html">Configuration API - Full Text Query</a> for more details.</p>
<h1 id="keeping-an-index-in-sync-with-datasets">Keeping an index in sync with Datasets</h1>
<p>If your dataset is mutable then you may wish to keep your full text index in sync with your dataset as it changes. To do this you can use the <a class="xref" href="../api/VDS.RDF.Query.Datasets.FullTextIndexedDataset.html"><code>FullTextIndexedDataset</code></a> which is a decorator that can be applied over another <a class="xref" href="../api/VDS.RDF.Query.Datasets.ISparqlDataset.html"><code>ISparqlDataset</code></a> and will automatically keep your index in sync with changes made to the dataset.</p>
</article>
          </div>

          <div class="hidden-sm col-md-2" role="complementary">
            <div class="sideaffix">
              <div class="contribution">
                <ul class="nav">
                  <li>
                    <a href="https://github.com/dotnetrdf/dotnetrdf/blob/main/docs/user_guide/full_text_querying_with_sparql.md/#L1" class="contribution-link">Improve this Doc</a>
                  </li>
                </ul>
              </div>
              <nav class="bs-docs-sidebar hidden-print hidden-xs hidden-sm affix" id="affix">
                <h5>In This Article</h5>
                <div></div>
              </nav>
            </div>
          </div>
        </div>
      </div>

      <footer>
        <div class="grad-bottom"></div>
        <div class="footer">
          <div class="container">
            <span class="pull-right">
              <a href="#top">Back to top</a>
            </span>
      
      <span>Generated by <strong>DocFX</strong></span>
          </div>
        </div>
      </footer>
    </div>

    <script type="text/javascript" src="../styles/docfx.vendor.js"></script>
    <script type="text/javascript" src="../styles/docfx.js"></script>
    <script type="text/javascript" src="../styles/main.js"></script>
  </body>
</html>
